<template>
  <div id="Main">
        <div class="title" style="font-size: 23px;padding-left: 20px; margin-bottom: 20px;float:left">
              <span class="el-icon-search"></span>
              信息搜索
        </div>
        <br>
    <el-card style="height:100px;width:1270px;margin-top:40px">
      <el-col :span="5">
        <el-input v-model="name" placeholder="请输入明星姓名"></el-input>
      </el-col>
      <el-col :span="2" :offset="1"><el-button type="primary" @click="Search" style="width:150px">查询</el-button></el-col>
      <br>      
    </el-card>
    <el-card style="margin-top:30px;height:500px;width:1270px" >
            <div slot="header" class="clearfix">
                <span>个人简介:</span>
                <span id="name"></span>
                <el-button style="float:right; padding: 3px 0" @click="open" type="text">更多信息</el-button>
            </div>
            <el-container style="height:400px">
              <el-aside width="300px" >
                  <el-image :src="img" style="width:300px;height:300px;margin-top:42px;margin-right:0px"></el-image>
              </el-aside>
              <el-main style="background-color:#FFFFFF;">
               <h4 id="name"></h4>
               <p id="demo1"></p>
              </el-main>
            </el-container>
    </el-card>
  </div>
</template>
<script>
export default {
  data(){
    return{
      name:'',
      datail:'',
      img:'',
      show3: false,
      drawer: false,
      data:[
        {
            "main": 1,
            "pic": 1,
            "perChName": "林志玲",
            "id": 0,
            "detail": "国籍：中国<br>民族：汉族<br>身高：173cm<br>三围：86、60、91<br>出生地：台湾省台北市<br>出生日期：1974年11月29日<br>职业：模特、演员、主持人<br>毕业院校：多伦多大学<br>简介：林志玲，台湾的超级名模，在两岸三地具有很高的知名度和影响力。林志玲出名前在台湾一所艺校兼职教舞，后被星探发现，才进入模特行业。2002年在香港拍摄的一支广告，因她甜美清纯的外表和姣好的身材而备受注目，知名度逐渐扩大。而后又因明星陪睡传闻和自身不断的绯闻而名气大增，借着经纪公司的策划与安排而一夕爆红，两岸三地都为她的气质内涵和美丽的外貌所瞩目。从2004年开始，林志玲开始进入演艺圈，并向香港和大陆发展，参演的电影主要有《赤壁》、《刺陵》、《决战刹马镇》等。2011年林志玲登上央视春晚，并与周杰伦一起演奏了歌曲《兰亭序》。林志玲自成名伊始就绯闻不断，已知的绯闻男友就有言承旭、周杰伦、邱士楷、孟庆松等人，2010年又深陷欠税官司。近期更因在第49届金马奖上与黄渤”爱在亲亲“和在湖南卫视娱乐节目《天天向上》上向欧弟”索吻“而被广大网友认为”志玲姐姐要转型“。网上亦流传有疑似林志玲的写真泳照，与其镜头前甜美优雅的形象相去甚远。"
        },
         {
            "main": 1,
            "pic": 1,
            "perChName": "周杰伦",
            "id": 1,
            "detail": "国籍：中国<br>民族：汉族<br>身高：175cm<br>出生地：台湾省新北市<br>出生日期：1979年1月18日<br>职业：音乐人、制作人、导演、企业家<br>毕业院校：淡江音乐学院<br>简评：周杰伦（Jay Chou），1979年1月18日出生于台湾省新北市，华语流行男歌手、演员、词曲创作人、MV及电影导演、编剧及制作人。2000年被吴宗宪发掘，发行首张个人专辑《Jay》。2001年发行专辑《范特西》。2002年在中国、新加坡、马来西亚、美国等地举办首场个人世界巡回演唱会。2003年登上美国《时代周刊》亚洲版封面人物。<br>娱乐圈外，周杰伦在2011年跨界担任华硕（ASUS）笔电外观设计师并入股香港文化传信集团。2012在中国内地开设真爱范特西连锁KTV。<br>除了力拼自己的事业，周杰伦还热心公益慈善活动，多次向内地灾区捐款并与众多艺人募款新建希望小学"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "孙怡",
            "id": 2,
            "detail": "国籍：中国<br>民族：汉族<br>身高：169cm<br>出生地：吉林<br>出生日期：1993年6月4日<br>职业：演员<br>简评：孙怡，清新可人的甜美怡人新生代90后演员，擅长舞蹈、钢琴、表演、卖萌等，为上海喜天影视文化公司旗下艺人。自出道以来一直活跃于演艺圈中，红于参演了《半月传》，代表作品有《我的青春》、《男欢女爱》、《半月传》、《大猫儿追爱记》等剧作。其微博昵称为“孙怡微博”"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "马天宇",
            "id": 3,
            "detail": "国籍：中国<br>民族：回族<br>身高：180cm<br>出生地：山东德州<br>出生日期：1986年7月12日<br>职业：歌手、演员<br>毕业院校：北京电影学院<br>简评：马天宇（Ray Ma），中国男演员、歌手。1986年7月12日出生于山东省德州市。毕业于北京电影学院。2006年参加“加油！好男儿”获得武汉赛区冠军、全国总决赛第六名、全国网络人气冠军，正式出道。2007年发行第一张唱片《宇光十色》获得亚太音乐榜唱片中国大陆地区销量冠军，主打歌《该死的温柔》更是获得了近1500万次的下载量。2008年发行第二张唱片《飞》，获得七彩颁奖典礼 “内地最佳男歌手” ，主打歌《青衣》一人分饰四角获得 “最佳音乐录影带”，《依然在一起》获得“十大金曲”奖。2010年发行EP《自言自宇》。2012年出演《宝贝妈妈宝贝女》男主角腹黑男章汉哲一角表现优秀，该剧获得全国卫视黄金时段电视剧收视冠军。2013年出演《少年神探狄仁杰》王元芳，翩翩佳公子形象大受好评。2016年2月7日，登上中央电视台春节联欢晚会，演出小品《是谁呢》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "王源",
            "id": 4,
            "detail": "国籍：中国<br>民族：汉族<br>身高：178cm<br>出生地：重庆<br>出生日期：2000年11月8日<br>职业：歌手<br>简评：王源，2000年11月8日出生于重庆，中国歌手。TFBOYS成员之一。2011年底加入TF家族成为练习生，2012年7月翻唱《一个像夏天一个像秋天》，2013年4月翻唱《当爱已成往事》、6月翻唱《洋葱》、11月翻唱《董小姐》。2013年8月6日，与王俊凯、易烊千玺以TFBOYS组合形式出道，陆续发行《爱出发》、《Heart》、《梦想起航》、《魔法城堡》、《青春修炼手册》、《幸运符号》、《快乐环岛》、《宠爱》等单曲。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张艺兴",
            "id": 5,
            "detail": "国籍：中国<br>民族：汉族<br>身高：178cm<br>出生地：湖南省长沙市<br>出生日期：1991年10月7日<br>职业：歌手、演员、主持人<br>毕业院校：湖南师范大学附属中学<br>简评：孙艺兴，中国男歌手。2012年4月张艺兴以SM公司新组合EXO和其子队EXO-M中国成员身份正式出道，2014年6月张艺兴以个人名义进行主持活动，先后主持《音乐风云榜》、《全球中文榜上榜》。8月参加江苏卫视个人综艺《星厨驾到》。9月参加浙江卫视综艺节目《星星的密室》。2015年3月张艺兴正式成立个人工作室。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "何炅",
            "id": 6,
            "detail": "国籍：中国<br>民族：汉族<br>身高：175cm<br>出生地：上海<br>出生日期：1990年11月2日<br>职业：主持人、演员<br>毕业院校：上海戏剧学院<br>简评：张大大，本名张韡，出生于上海，中国大陆男主持人，毕业于上海戏剧学院。2010年开始担任湖南卫视主持人，主持湖南娱乐频道节目《单身厨房》，担任2010年度星姐选举主持人。2011年开始主持节目《挑战麦克风》。2013年2月，担任《我是歌手》选手黄贯中经纪人。7月，搭档沈梦辰主持节目《娱乐急先锋》。2015年担任《我是歌手》中谭维维的芒果“经纪人”。"
        },{
            "main": 1,
            "pic": 1,
            "perChName": "张大大",
            "id": 7,
            "detail": "国籍：中国<br>民族：汉族<br>身高：175cm<br>出生地：上海<br>出生日期：1990年11月2日<br>职业：主持人、演员<br>毕业院校：上海戏剧学院<br>简评：张大大，本名张韡，出生于上海，中国大陆男主持人，毕业于上海戏剧学院。2010年开始担任湖南卫视主持人，主持湖南娱乐频道节目《单身厨房》，担任2010年度星姐选举主持人。2011年开始主持节目《挑战麦克风》。2013年2月，担任《我是歌手》选手黄贯中经纪人。7月，搭档沈梦辰主持节目《娱乐急先锋》。2015年担任《我是歌手》中谭维维的芒果“经纪人”。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "谭维维",
            "id": 8,
            "detail": "谭维维，1982年10月8日出生于四川自贡，中国内地女歌手。<br>2002年参加全国歌手大奖赛获优秀奖。2003年出演电视剧《心跳》；同年获得中国金唱片奖最佳新人奖。2006年参加湖南卫视“超级女声”获得成都区冠军、全国总决赛亚军，并发表首支个人单曲《如果我没有爱过》。2007年出演音乐剧《蝶》 ，同年发表首张个人专辑《耳界》。2008年4月27日在北京首开个人演唱会。2009年凭借《遇见》获得台湾电影金马奖最佳原创歌曲奖。2011年获得第11届华语音乐传媒大奖最佳国语女歌手奖。2012年主演电影《秘密花园》。2013年发行专辑《乌龟的阿基里斯》。2015年参加《我是歌手》第三季并进入总决赛；11月，加盟东方卫视《中国之星》，在第三期以一首原创曲目《给你一点颜色》获得当期冠军。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "Angelababy",
            "id": 9,
            "detail": "国籍：中国<br>民族：汉族<br>身高：168cm<br>出生地：上海<br>出生日期：1989年2月28日<br>职业：演员、歌手、模特<br>毕业院校：嘉诺撒圣心商学书院<br>简评：Angelababy，名为杨颖的上海女孩，是与杨幂、刘诗诗、倪妮当选的新生代“四小花旦”之首，一位家喻户晓且最受欢迎与瞩目的女演员，常居百度热搜榜首。<br>于1989年在上海出生的，一位梦想成为明星的女孩，从小就接受演戏与跳舞的学习训练；后回港入Talent Bang担任Viva Club Disney主持，并于其14岁时成为摄影沙龙的模特。可惜那时的她形象不佳，完全缺乏竞争力；于是敢想敢为的她，就根据当下日本流行的美模梨花、Lena等人的造型进行了自我改造，利用网络成功的打破了香港所流行的玉女气质，被众多港女模仿，亦因此得以成功与日本经纪公司签约，成为潮流杂志《Ray》和《Dear》模特，从而使她从低谷走入成功，开始她的演艺事业的黄金期。<br>从模特出道，以舞者身份加持，于2007年受周杰伦之邀，在其演唱会中担任一名舞者；并升华为一名演员，于2009年拍摄了《全城热恋》和2012年的《第一次》爱情片等，更是凭凭借《第一次》的拍摄而荣获第十三届华语电影传媒大奖“最受瞩目女演员奖”。而于2010年再度进军日本的她，在Tokyo Fashion Week揭幕时荣获“香港女神”之称。<br>演艺界中大放光彩的她，有着很强的投资理财头脑，2012年不仅与人合资开设了“baby cafe”咖啡店，在2013年中与人合资开设了一站式服务的四层生活潮流小店，进驻一切美丽且潮流之物，并进驻了香港水磨坊。事业丰收的她，感情上亦是幸福的，与黄晓明从2010年相恋至今，恩爱美满的生活着。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "赵韩樱子",
            "id": 10,
            "detail": "国籍：中国<br>民族：汉族<br>身高：169cm<br>出生地：山东省烟台市<br>出生日期：1990年12月16日<br>职业：演员、模特<br>毕业院校：中央戏剧学院<br>简评：赵韩樱子，来自烟台的单纯认真的漂亮演员、模特，总是能把自己代入角色中，毕业于中央戏剧学院表演系。于2009年参与网络春晚演出，同年于第二届中国美容皇后大赛中获得中国美目皇后“最佳上镜皇后”奖。<br>2010年，尚为高中生的她就从事模特一职，并参演众多综艺、选秀节目，荣获众多奖项。隔年就参演了其首部电视剧作品《就让咖啡有点甜》，随后又参演了《我和春天有个约会》、《爱在春天》、《因为爱情有多美》、《新济公活佛》、《因为爱情有奇迹》、《我们都爱笑》、《神雕侠侣》、《真命天使》等影视作品。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "李宇春",
            "id": 11,
            "detail": "国籍：中国<br>民族：汉族<br>身高：175cm<br>出生地：四川省成都市<br>出生日期：1984年3月10日<br>职业：歌手、创作人、演员、导演<br>毕业院校：四川音乐学院<br>简评：李宇春，中国首位民选超级巨星，中国当代最具影响力的流行女歌手。2005年在湖南电视台举办的超级女声比赛中以冠军出道，之后红遍全国并蜚声国际，开创了中国大陆流行音乐与超级偶像的新时代，也在当时成为一个流行的社会文化现象，对中国社会的影响力巨大。李宇春从2009年开始踏足影视圈，先后在电影《十月围城》、《龙门飞甲》、《血滴子》中担任重要角色，演技获得观众及歌迷的肯定。如今，李宇春在音乐和电影领域之外，还涉足话剧、时尚、商业等多个领域，同时热心慈善，关注公益，其歌迷还为此设立“玉米爱心基金”，其榜样的力量对中国慈善事业的发展影响不可估量。李宇春被其粉丝呼为“春春”，而粉丝们则自称为“玉米”。在网络上，网络恶搞文化也对李宇春情有独衷，“春哥”这一流行网络文化的背后便与李宇春有着一定的渊源。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "刘涛",
            "id": 12,
            "detail": "国籍：中国<br>民族：汉族<br>身高：162cm<br>出生地：四川成都<br>出生日期：1987年2月28日<br>职业：演员、模特<br>毕业院校：中央戏剧学院<br>简评：王子文，1987年2月28日出生于四川成都，中国内地女演员、模特，毕业于中央戏剧学院。<br>2006年出演首部电视剧《谁是我爸爸》和首部电影《姨妈的后现代生活》；同年在电视剧《寒秋》中担任女主角而受到关注；2010年出演电影《无人驾驶》和《唐山大地震》；2011年主演家庭情感剧《家，n次方》和都市情感剧《男人帮》获得更多的关注；2012年出演年代电影《一九四二》；2013年在爱情电影《爱神来了》中担任女一号。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "王子文",
            "id": 13,
            "detail": "国籍：中国<br>民族：汉族<br>身高：162cm<br>出生地：四川成都<br>出生日期：1987年2月28日<br>职业：演员、模特<br>毕业院校：中央戏剧学院<br>简评：王子文，1987年2月28日出生于四川成都，中国内地女演员、模特，毕业于中央戏剧学院。<br>2006年出演首部电视剧《谁是我爸爸》和首部电影《姨妈的后现代生活》；同年在电视剧《寒秋》中担任女主角而受到关注；2010年出演电影《无人驾驶》和《唐山大地震》；2011年主演家庭情感剧《家，n次方》和都市情感剧《男人帮》获得更多的关注；2012年出演年代电影《一九四二》；2013年在爱情电影《爱神来了》中担任女一号。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "徐熙娣",
            "id": 14,
            "detail": "国籍：中国<br>民族：汉族<br>身高：158cm<br>出生地：台湾台北<br>出生日期：1978年6月14日<br>职业：主持人、歌手、演员<br>毕业院校：华冈艺校<br>简评：徐熙娣（小S，Elephant Dee），1978年6月14日生于台湾台北市，祖籍山东郯城，中国台湾主持人、歌手、演员。1994年起与姐姐大S组成歌唱团体SOS（后更名ASOS）出道，亦参与戏剧演出。1998至2006年间主持《娱乐百分百》受到广泛关注。2000年和姐姐再度合作，推出专辑《变态少女》。2004年起与蔡康永主持综艺节目《康熙来了》，凭借该节目于2005年夺得第40届金钟奖最佳综艺节目主持人奖，并且走红于华语区。2005年与许雅钧结婚并育有3女。2013年位列福布斯中国名人榜第27位。2007年至2008年与姐姐大S主持美食节目《大小爱吃》。小S曾多次担任台湾金马奖、金曲奖和金钟奖晚会的主持人。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "杨幂",
            "id": 15,
            "detail": "国籍：中国<br>民族：汉族<br>身高：166cm<br>三围：39D、28、35<br>出生地：北京市宣武区<br>出生日期：1986年9月12日<br>职业：演员、歌手、制片人<br>毕业院校：北京电影学院<br>简评：杨幂（1986年9月12日—），中国女演员、歌手、电视剧制片人。出生于北京。毕业于北京电影学院表演系2005级本科班。她曾获得第24届、第26届中国电视金鹰奖提名，第17届上海电视节白玉兰奖两项提名，并且获得一项白玉兰奖。在2009年4月的“80后新生代娱乐大明星”评选活动中，成为内地新“四小花旦”（与黄圣依、王珞丹以及刘亦菲）之一。<br>2006年因出演《神雕侠侣》中“小东邪”郭襄而受到观众的关注，2009年又凭借《仙剑奇侠传三》而人气飙升。2011年因为在穿越剧《宫》中扮演洛晴川一角而获得了更高的人气。2012年发行了音乐专辑《亲幂关系Close to Me》，同年成立了杨幂工作室。之后由她主演的《如意》、《命运交响曲》、《盛夏晚晴天》等电视剧均获得不俗的收视率。2013年，由她主演的《小时代》系列电影取得了近8亿的票房，票房号召力再度引起媒体关注。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "范冰冰",
            "id": 16,
            "detail": "国籍：中国<br>民族：汉族<br>身高：168cm<br>出生地：山东青岛<br>出生日期：1981年9月16日<br>职业：演员、歌手<br>毕业院校：上海师范大学谢晋影视艺术学院<br>简评：范冰冰，1981年9月16日出生于山东青岛，毕业于上海师范大学谢晋影视艺术学院，中国女演员，歌手。1998年演琼瑶剧《还珠格格》一举成名。2004年凭借电影《手机》荣获第27届大众电影百花奖最佳女演员奖。2007主演电影《心中有鬼》荣获第44届台湾电影金马奖最佳女配角奖，同年其主演的电影《苹果》提名第57届柏林国际电影节金熊奖，并凭借此片荣获第4届欧亚国际电影节最佳女演员奖，成为第一位获此殊荣的华人明星，跻身国际影坛，随即成立范冰冰工作室，签约旗下艺人，并制作出《胭脂雪》和《金大班》等电视剧。2010年主演电影《观音山》荣获第23届东京国际电影节最佳女演员奖。2011年担任东京国际电影节评委。2010-2013数次受邀出席戛纳国际电影节、奥斯卡等国际电影节典礼。2013年戛纳国际电影节萧邦珠宝举办“范冰冰之夜”，并授予范冰冰“年度最佳国际艺人”称号。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "李治廷",
            "id": 17,
            "detail": "国籍：加拿大<br>民族：中国、中东、马来西亚混血儿<br>身高：175cm<br>出生地：香港<br>出生日期：1987年2月26日<br>职业：歌手、演员、词曲创作者<br>毕业院校：英国伦敦帝国学院物理系<br>简评：李治廷，香港新生代演员及歌手，2008年回港正式进入演艺圈，发行第一张专辑便横扫年度香港各大音乐颁奖礼的新人奖，在新城劲爆颁奖礼2009获得新城劲爆新人王（男歌手），2009年度叱咤乐坛流行榜颁奖典礼获得叱咤乐坛生力军男歌手金奖。2009年首次拍摄电影《岁月神偷》，更于第29届香港电影金像奖获得最佳新演员奖，被誉为华语影坛和歌坛最有潜质的新星之一。近期热播新剧《武则天》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "马思纯",
            "id": 18,
            "detail": "国籍：中国<br>民族：回族<br>身高：170cm<br>出生地：安徽蚌埠<br>出生日期：1988年3月14日<br>职业：演员<br>毕业院校：中国传媒大学<br>简评：马思纯（Sandra），1988年3月14日出生于安徽省蚌埠市，中国内地影视女演员。1995年，马思纯参演个人首部电影《三个人的冬天》。2000年，马思纯参演个人首部电视剧《大宅门》。2007年，她因担任饶雪漫小说《甜酸》的书模而被更多人认识。2008年，马思纯主演了爱情剧《恋人》。2011年，马思纯出演了都市剧《摩登新人类》。2012年，她凭借电影《岁月无声》获得中国电影表演艺术学会最佳新人奖。2013年，马思纯主演了言情剧《未婚妻》。2014年，马思纯凭借青春片《左耳》赢得更多观众的肯定，并获得第52届台湾金马奖最佳女配角提名。2015年，马思纯主演了悬爱剧《他来了请闭眼》；同年，她还出版了个人首本图文随笔集《如果有一件小事是重要的》。2016年，其主演的冒险片《盗墓笔记》票房突破十亿人民币；同年，马思纯凭借剧情片《七月与安生》获得第53届台湾电影金马奖最佳女主角奖。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "古力娜扎",
            "id": 19,
            "detail": "国籍：中国<br>民族：维吾尔族<br>身高：172cm<br>出生地：新疆乌鲁木齐<br>出生日期：1992年5月2日<br>职业：演员、模特<br>毕业院校：北京电影学院表演系<br>简评：娜扎，来自新疆的美丽沉静，俏皮可爱的优雅维吾尔族姑娘，90后“宅男杀手”的新一代神仙姐姐。2013年期间曾被网友评为最美女生。<br>从小有着舞蹈梦的她，演艺多年，机缘下尚是16岁的她就成为一名平面模特，后于2009年参加模特大赛，被评为最上镜选手。正式出道于2012年《轩辕剑之天之痕》中饰演“小雪”一角，而备受关注熟知，随后主演了《警察故事2013》、《分手大师》、《痞子英雄之黎明升起》和《全城通缉》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "井柏然",
            "id": 20,
            "detail": "国籍：中国<br>民族：汉族<br>身高：183cm<br>出生地：辽宁沈阳<br>出生日期：1989年4月19日<br>职业：演员、歌手<br>毕业院校：沈阳外事服务学校<br>简评：井柏然，中国内地新生代男演员、歌手。1989年4月19日出生于辽宁省沈阳市。<br>2007年，18岁的他被东方卫视《加油好男儿》制片人发现并受邀参赛，获得分赛区冠军，并且最终获得全国总冠军，被华谊兄弟时代文化经纪有限公司招至旗下。2010年凭借首部电影作品《全城热恋》获第17届北京大学生电影节“最佳新人奖”，2011年提名第30届香港电影金像奖”最佳新演员”。<br>2013年因主演郑晓龙导演的电视剧《新编辑部故事》中的何澈澈一角而受到广大观众喜爱，随后在《失恋33天》团队打造的电影《等风来》中担纲男一号。2014年参演《黄飞鸿之英雄有梦》和《失孤》等电影。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "江疏影",
            "id": 21,
            "detail": "国籍：中国<br>民族：汉族<br>身高：168cm<br>出生地：上海<br>出生日期：1986年9月1日<br>职业：演员<br>毕业院校：上海戏剧学院、东英格利亚大学<br>简评：江疏影，1986年9月1日出生于上海，中国内地女演员，毕业于上海戏剧学院2004级表演系本科班，英国东英格利亚大学传媒经济学2009级硕士。<br>2005年出演首部电视剧《飞花如蝶》“金凤”一角而出道。2013年在电影《致我们终将逝去的青春》出演校园女神“阮莞”得到广泛关注，凭借该片获得第五届英国万像国际华语电影节最佳女配角奖和第八届亚洲电影大奖最佳新演员奖。2014年在都市时尚情感剧《一仆二主》饰演绿茶女神“顾菁菁”，凭借该片提名第21届上海电视节最佳女配角，斩获第17届华鼎奖中国百强电视剧最佳女配角。。2016年4月1日，主演青春热血励志剧《旋风十一人》，剧中饰演表格领队“裴朵”。2016年5月31日，主演的都市情感剧《好先生》首播，剧中饰演千金烈女“江莱”。2016年7月7日，主演都市爱情剧《一路繁花相送》，剧中饰演女一号任性少女“辛辰”。"
        },
        {
            "main": 1,
            "pic": 0,
            "perChName": "经纪人甲",
            "id": 22,
            "detail": "xxx经纪人"
        },
        {
            "main": 1,
            "pic": 0,
            "perChName": "经纪人乙",
            "id": 23,
            "detail": "xxx经纪人"
        },
        {
            "main": 1,
            "pic": 0,
            "perChName": "经纪人丙",
            "id": 24,
            "detail": "xxx经纪人"
        },
        {
            "main": 1,
            "pic": 0,
            "perChName": "经纪人丁",
            "id": 25,
            "detail": "xxx经纪人"
        },
        {
            "main": 1,
            "pic": 0,
            "perChName": "经纪人戊",
            "id": 26,
            "detail": "xxx经纪人"
        },
        {
            "main": 1,
            "pic": 0,
            "perChName": "经纪人已",
            "id": 27,
            "detail": "xxx经纪人"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "汤唯",
            "id": 28,
            "detail": "汤唯<br>1979年10月7日出生于浙江杭州<br>中国内地女演员<br>毕业于中央戏剧学院导演系本科。在大学期间，汤唯出演了《如梦之梦》、《切·格瓦拉》等话剧作品。2004年，主演了个人首部电影作品《警花燕子》，并凭借该片获得第六届电影频道数字电影百合奖“优秀女演员”奖。2007年，因出演剧情片《色·戒》中王佳芝一角获得更多关注，并凭该片夺得第44届台湾电影金马奖最佳新人奖。2010年，凭借爱情片《月满轩尼诗》获得第11届华语电影传媒大奖最佳女主角奖"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "林心如",
            "id": 29,
            "detail": "林心如（Ruby Lin），1976年1月27日出生于台湾省台北市，台湾女演员、歌手、影视制作人。1993年以兼职广告模特出道。1994年因与郭富城合拍广告而正式踏入演艺圈。1998年凭借清宫剧《还珠格格》中“夏紫薇”一角而被观众所熟知，次年继续主演《还珠格格第二部》，该剧先后打破并创造了中国电视剧收视记录。2001年主演的民国剧《情深深雨濛濛》成为年度收视冠军，发行首张国语专辑《双面林心如》。2003年主演励志剧《男才女貌》、年代戏《半生缘》。2006年主演都市爱情剧《地下铁》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "谢娜",
            "id": 30,
            "detail": "谢娜，1981年5月6日出生于四川省德阳市中江县，毕业于四川师范大学电影电视学院（今四川电影电视学院），中国内地主持人、歌手、影视女演员。1996年，谢娜拍摄了个人第一部电影《青年刘伯承》。2002年，因主持湖南卫视嘉宾访谈游戏秀节目《快乐大本营》被观众熟知。2008年，参演古装武侠剧《射雕英雄传》。2013年，主演喜剧片《快乐大本营之快乐到家》；同年，她还获得中国大学生电视节最受大学生喜爱的电视节目主持人奖[3]  。2015年，参加明星生活体验秀节目《偶像来了》；同年，她还主持了两季伪音乐类纯网络综艺节目《偶滴歌神啊》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "章子怡",
            "id": 31,
            "detail": "章子怡，1979年2月9日出生于北京，华语影视女演员，2000年毕业于中央戏剧学院。1998年被张艺谋发掘，凭主演的个人首部电影《我的父亲母亲》获得第50届柏林国际电影节银熊奖而一举成名。1999年主演的电影《卧虎藏龙》荣获第73届奥斯卡、第58届金球奖最佳外语片奖，因此跻身国际影坛[1]  。2005年主演斯皮尔伯格监制的电影《艺伎回忆录》，该片获得第78届奥斯卡三项大奖，章子怡成为主演电影两度获得奥斯卡奖的华人演员，并入围美国电影金球奖、英国电影学院奖、美国演员工会奖最佳女演员奖[2]  ；同年登上《Vanity Fair》封面、第四次登上《时代周刊》封面并上榜“影响世界的100人”，并入选“中国电影百年百位优秀演员”。[3-4]  2010年被亚洲电影博览会授予“21世纪前十年亚洲最杰出女演员”称号[5] "
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "沈腾",
            "id": 32,
            "detail": "沈腾，1979年10月23日出生于黑龙江省齐齐哈尔市，中国内地影视导演、演员，开心麻花舞台剧签约艺人。毕业于解放军艺术学院戏剧表演系。2003年，沈腾出演开心麻花第一部舞台剧《想吃麻花现给你拧》。2006年，沈腾出演话剧《我在天堂等你》。2012年1月22日，沈腾首次登上央视春晚并在春晚上表演小品《今天的幸福》，在小品中饰演贱贱的还有点二的“郝建”。2013年2月9日，沈腾再次登上央视春晚并表演小品《今天的幸福2》。”。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "汪峰",
            "id": 33,
            "detail": "汪峰，男，祖籍江苏常州[1-2]  ，1971年6月29日出生于北京。中国大陆摇滚歌手、音乐创作人、作词人、作曲人，鲍家街43号乐队发起人"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "冯绍峰",
            "id": 34,
            "detail": "冯绍峰，1978年10月7日出生于上海，中国大陆男演员，毕业于上海戏剧学院。1998年出演了个人首部电影《星星串》，从而进入演艺圈。2003年参演时装剧《男才女貌》。2007年参演商战剧《岁月风云》。2011年1月因在清装穿越剧《宫锁心玉》中饰演八阿哥一角获得关注。2012年凭借古装动作片《鸿门宴》获得第24届哈尔滨冰雪电影节2011年度华语电影产业最具商业价值男新人奖。2013年主演古装剧《兰陵王》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "金星",
            "id": 35,
            "detail": "金星，1967年8月13日出生在辽宁沈阳，中国舞蹈家、脱口秀主持人。1978年加入沈阳军区前进歌舞团。1984年毕业于解放军艺术学院舞蹈系。1995年接受变性手术。2011年担任《舞林大会》评委。2012年主持个人脱口秀节目《金星撞火星》。2014年在《舞林争霸》中担任导师。2015年1月，主持个人脱口秀节目《金星秀》。2015年3月，在《超级演说家》担任导师[1]  。2016年4月，参与录制《极速前进第三季》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陈道明",
            "id": 36,
            "detail": "陈道明，1955年4月26日出生于天津，祖籍浙江绍兴。国家一级演员，第十届、十一届、十二届全国政协委员，中国文学艺术界联合会第八次全国代表，广电总局颁发优秀电影表演艺术家，2006年中宣部“四个一批”人才，中国环境文化促进会理事，中国电视艺术家协会委员"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陈希妍",
            "id": 37,
            "detail": "陈妍希，1983年5月31日出生于台湾台北，华语影视女演员、流行乐歌手，毕业于南加利福尼亚大学。2006年，出演个人首部电视剧《换换爱》而进入演艺圈。2009年，凭借爱情片《听说》提名第46届金马奖最佳新人演员。2011年，因出演青春爱情片《那些年，我们一起追的女孩》中沈佳宜一角获得关注，并凭借该片提名第48届台湾电影金马奖最佳女主角。2013年，发行个人首张原创音乐专辑《Me,Myself,And I》，并获得第11届CCTV-MTV音乐盛典港澳台地区年度最受欢迎潜力歌手"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "刘亦菲",
            "id": 38,
            "detail": "刘亦菲，1987年8月25日出生于湖北省武汉市，华语女演员、流行乐歌手，毕业于北京电影学院2002级表演系本科班。2002年主演个人首部电视剧《金粉世家》，从而踏入演艺圈。2003年因主演武侠剧《天龙八部》崭露头角。2004年凭借仙侠剧《仙剑奇侠传》赵灵儿一角获得了高人气与关注度。2006年因在金庸剧《神雕侠侣》中饰演小龙女再次受到广泛关注；同年，发行首张国语专辑《刘亦菲》。2008年起转战影坛，并出演了好莱坞电影《功夫之王》。2011年起，其主演的奇幻片《新倩女幽魂》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陈赫",
            "id": 39,
            "detail": "陈赫，1985年11月9日出生于福建省长乐市，毕业于上海戏剧学院表演系，上海话剧艺术中心演员，中国内地男演员、歌手、主持人。2009年，在都市爱情喜剧《爱情公寓》中凭借饰演曾小贤一角受到关注。2014年，加盟大型户外竞技真人秀节目《奔跑吧兄弟》，并主演电影版；同年，主演的都市爱情喜剧《爱情公寓4》在首播后打破国产电视剧网络播放纪录；12月17日，在安徽卫视“2014国剧盛典”中荣获年度极具青春号召力演员奖；12月24日，与Angelababy主演的爱情喜剧电影《微爱之渐入佳境》全国上映"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "林丹",
            "id": 40,
            "detail": "林丹，汉族，1983年10月14日生于福建省龙岩市上杭县临江镇。中国羽毛球男子单打运动员。2008年北京奥运会、2012年伦敦奥运会男子单打项目冠军。羽毛球运动历史上第一位集奥运会冠军、世锦赛冠军、世界杯冠军、亚运会冠军、亚锦赛冠军、全英赛冠军以及多座世界羽联超级系列赛冠军于一身的全满贯球员。[1]  被誉为中国羽球一哥。世界羽毛球界四大天王之一。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "周冬雨",
            "id": 41,
            "detail": "周冬雨，1992年1月31日出生于河北省石家庄市，毕业于北京电影学院2011级本科班，中国内地影视女演员。2010年，因主演张艺谋执导电影《山楂树之恋》被观众熟知，并凭借此片获得第14届中国电影华表奖优秀新人女演员奖、第56届西班牙巴利亚多利德国际电影节最佳女演员等多个奖项。2013年，主演古装爱情电影《宫锁沉香》。2014年，因主演青春爱情电影《同桌的你》获得第15届华语电影传媒大奖年度最受瞩目女演员奖，该电影中国内地票房4.56亿。2015年担任中国电影节形象大使。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "岳云鹏",
            "id": 42,
            "detail": "岳云鹏，1985年4月15日出生，河南濮阳人，德云社青年相声演员、中国大陆影视男演员，和孙越、朱云峰、闫云达并称“德云四少”。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "海清",
            "id": 43,
            "detail": "海清，本名黄怡，1978年1月12日生于江苏省南京市，毕业于北京电影学院表演系，中国内地影视女演员。2003年，通过出演电视剧《玉观音》中的钟宁一角而出道。2009年11月，出演滕华涛执导的都市情感剧《蜗居》，该剧让海清的演艺事业取得了一定的成功。2010年，凭借主演爱情电视剧《媳妇的美好时代》获得第28届中国电视剧“飞天奖”优秀女演员奖，和第25届中国电视金鹰奖观众喜爱的电视剧女演员奖。2012年，海清主演的国内首部医患关系题材电视剧《心术》引起广泛关注和反响；"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张艺谋",
            "id": 44,
            "detail": "张艺谋曾任第18届东京国际电影节评委会主席和第64届威尼斯国际电影节评委会主席。2008年担任北京奥运会开幕式和闭幕式总导演，获得2008影响世界华人大奖和央视主办的感动中国十大人物，并提名美国《时代周刊》年度人物。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "朗朗",
            "id": 45,
            "detail": "郎朗（Lang Lang），1982年6月14日出生于辽宁省沈阳市沈河区，钢琴演奏者，毕业于美国柯蒂斯音乐学院。1999年，参加美国芝加哥“拉维尼亚音乐节”世纪庆典明星音乐会，从而开始了他的音乐演奏生涯。2001年，在人民大会堂进行100周年百年庆典巡演。2003年，推出个人钢琴演奏专辑《柴可夫斯基/门德尔松协奏曲名录》。2005年，在白宫举行个人专场独奏会。2006年，推出个人钢琴演奏专辑《黄河之子》。2008年，获得美国录音师协会颁发的“艺术荣誉奖”。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张涵予",
            "id": 46,
            "detail": "张涵予，1964年12月19日出生于北京，籍贯陕西蓝田，中国内地男演员。中国文学艺术界联合会第十届全委会委员。1988年毕业于中央戏剧学院表演系。1983年担任专业配音演员，2002年首次参演冯小刚电影《大腕》。2008年凭借《集结号》获得北京大学生电影节最佳男主角、大众电影百花奖最佳男主角、台湾电影金马奖最佳男主角、华语电影传媒大奖最佳男主角、中国电影华表奖优秀男演员等奖项。2009年主演电影《风声》。2013年主演电影《厨子戏子痞子》。2015年凭借《智取威虎山》获得中国电影金鸡奖"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "王凯",
            "id": 47,
            "detail": "王凯，1982年8月18日出生于湖北武汉，中国内地男演员，毕业于中央戏剧学院03级表演班。2005年，出演首部电视剧《寒秋》进入娱乐圈。2008年，出演《丑女无敌》系列。2012年，主演张新建执导的电视剧《知青》。2012年6月，参演电视剧《新神探联盟》。2013年，参演电视剧《北平无战事》。2014年，凭借电影《黄克功案件》获第九届华语青年影像论坛年度新锐男演员奖；同年，因出演古装权谋剧《琅琊榜》而获得关注，王凯凭借剧中萧景琰一角获得亚洲彩虹奖最佳男配角的称号。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "李晨",
            "id": 48,
            "detail": "李晨（Jerry Lee），1978年11月24日出生于北京市，中国内地影视男演员、导演、监制、赛车手，毕业于北京群星艺术学院。1997年，出演个人首部电视剧《十七岁不哭》，从而正式进入演艺圈。1998年，主演警匪剧《刑警本色》。2002年，在清宫剧《十三格格》中饰演男主角七贝勒。2004年，主演警匪剧《危情24小时》。2005年，主演刑侦剧《一针见血》。2006年，主演青春励志剧《士兵突击》。2007年，主演剧情电影《地下的天空》。2008年"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张一山",
            "id": 49,
            "detail": "张一山，1992年5月5日出生于北京市西城区，毕业于北京电影学院，中国内地男演员。2000年，张一山开始拍摄广告片，后被导演徐耿相中，出演首部电视剧作品《小兵张嘎》。2004年，因在少儿题材的情景喜剧《家有儿女》中饰演刘星后而被观众们熟知。2007年，获得腾讯星光大典年度潜力演艺新人奖。2008年，出演少年励志电影电影《扣篮对决》。2009年，主演儿童电影《寻找成龙》。2011年10月9日，张一山夺得《舞林大会》的冠军，后考入北京电影学院。主演战争励志轻喜剧《大号小兵》；"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "薛之谦",
            "id": 50,
            "detail": "薛之谦（Joker Xue），1983年7月17日出生于上海，华语流行乐男歌手、影视演员、音乐制作人，毕业于格里昂酒店管理学院。2005年，因参加选秀节目《我型我秀》而正式出道[1]  。2006年，发行首张同名专辑《薛之谦》，随后凭借歌曲《认真的雪》获得广泛关注[2-3]  。2007年，凭借专辑《你过得好吗》获得MusicRadio中国TOP排行榜内地年度最受欢迎男歌手奖。2008年，发行专辑《深深爱过你》，同年在上海举行个人首场演唱会“谦年传说”[4-5]  。2013年，专辑《几个薛之谦》获得MusicRadio中国TOP排行榜内地推荐唱片[6]  。2014年，凭借专辑《意外》获得第21届东方风云榜颁奖最佳唱作人[7]  ；同年他还获得音悦V榜年度盛典年度创作歌手奖"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "佟大为",
            "id": 51,
            "detail": "佟大为，1979年2月3日生于辽宁省抚顺市新抚区，中国大陆男演员、歌手。2001年毕业于上海戏剧学院表演系。2004年凭借电视剧《玉观音》夺得第22届中国电视金鹰奖观众喜爱的电视剧男演员奖。同年主演电视剧《与青春有关的日子》。2007年主演赵宝刚导演的电视剧《奋斗》饰演男一号陆涛。同年主演电视剧《我们无处安放的青春》。2010年主演赵宝刚执导的电视剧《婚姻保卫战》。2013年主演丁黑执导的电视剧《门第》。2014年和妻子关悦合演电视剧《我的儿子是奇葩》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "景甜",
            "id": 52,
            "detail": "景甜（Jing Tian），1988年7月21日出生于陕西省西安市，毕业于北京电影学院表演系，华语影视女演员。2006年，景甜发行了个人首张音乐EP《你是谁》，并正式踏上演艺之路。2010年，景甜凭借爱情片《我的美女老板》崭露头角。2011年，景甜因主演古装片《战国》而获得更多关注。2013年开始，其主演的动作片《特殊身份》，警匪片《警察故事2013》，贺岁片《澳门风云》，合计票房超过12亿人民币。2014年，景甜主演了古装剧《班淑传奇》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "莫文蔚",
            "id": 53,
            "detail": "莫文蔚（Karen Joy Morris，艺名Karen Mok），混血儿，1970年6月2日出生于中国香港，歌手和演员。1993年发行首张粤语唱片《karen莫文蔚》进入娱乐圈；1995年主演电影《大话西游》获得关注。1996年凭借电影《堕落天使》获得香港电影金像奖最佳女配角奖。1997年莫文蔚在台湾推出首张国语唱片《做自己》，专辑卖出80多万张，主打歌《他不爱我》成为其代表作之一；1999年被香港时装设计师协会评为香港十大杰出衣着人士。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "彭于晏",
            "id": 54,
            "detail": "彭于晏，1982年3月24日出生于台湾澎湖，中国台湾影视男演员、歌手。2002年，彭于晏出演了首部电视剧《爱情白皮书》 而踏入演艺圈。2005年因出演仙侠剧《仙剑奇侠传》中唐钰一角而受到关注。2006年主演剧情片《六号出口》。2007年凭借爱情片《基因决定我爱你》提名第44届台湾电影金马奖最佳新演员，并为金马短片单元制作片头，完成了个人导演处女作。2009年发行首张个人EP《非爱不可》。2011年彭于晏凭借励志片《翻滚吧！阿信》提名第48届台湾电影金马奖最佳男主角。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "刘雯",
            "id": 55,
            "detail": "刘雯，1988年1月27日出生，湖南永州人，中国模特。2009年，作为第一个亚洲模特登上“维多利亚的秘密”内衣秀。继2011年之后再度入榜男性网站ASKMEN评选出的2012年度全球最美的99人[3]  。2013年8月29日，在模特网站MDC top50 公布的榜单上位列第三[4]  。2014年7月26日，入选MDC “New Supers”全球新超模榜单，成为首位进入“New Supers”榜单的亚裔模特。[5]  2014年在福布斯公布的全球模特收入榜中，以700万美元与米兰达·可儿、凯特莫斯并列第三。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "黄子韬",
            "id": 56,
            "detail": "黄子韬，1993年5月2日出生于山东省青岛市，中国流行乐男歌手、演员。2012年，黄子韬以TAO为艺名随EXO组合正式出道。2015年6月11日，黄子韬Z.TAO工作室正式成立；7月20日，黄子韬发行首张个人数字专辑《T.A.O》；8月23日，在北京举行首场个人Mini公益演唱会；12月5日，受邀出席第九届音乐盛典咪咕汇，并获得年度最受欢迎舞台表现奖。2016年5月1日，黄子韬在南京举办“THE ROAD”演唱会；6月11日，作为固定嘉宾出演安徽卫视实境生存记录节目《我们的法则》；"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "佟丽娅",
            "id": 57,
            "detail": "佟丽娅，1984年8月8日出生于新疆伊犁，毕业于中央戏剧学院表演系本科班，中国内地影视女演员。2006年，学生时期的佟丽娅便因出演情感剧《新不了情》而踏入影视领域。2008年，佟丽娅因在古装剧《母仪天下》中饰演赵飞燕而崭露头角。2011年开始，佟丽娅凭借穿越剧《宫锁心玉》、爱情剧《北京爱情故事》获得更多关注；并义务出任了锡伯族形象大使。2012年，她凭借在多部影视剧中的表现获得亚洲偶像盛典年度最具实力女演员奖；同年，她还主演了都市剧《恋恋不忘》，并担任了第4届中国大学生电视节形象大使。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "赵又廷",
            "id": 58,
            "detail": "赵又廷（Mark Chao），1984年9月25日出生于台湾省台北市，华语影视男演员，毕业于加拿大维多利亚大学。2009年，出演了个人首部电视剧《痞子英雄》，并凭该片获得第44届台湾电视金钟奖最佳男主角[1]  。2010年，主演首部大银幕作品《艋舺》，并凭借该片获得第5届亚洲电影大奖最佳新演员奖[2]  。2012年，赵又廷主演的爱情片《LOVE》取得了1.25亿元的票房成绩[3]  ；同年，凭借剧情片《搜索》中杨守诚一角获得第15届中国电影华表奖优秀境外华裔男演员奖"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张杰",
            "id": 59,
            "detail": "张杰，1982年12月20日出生于四川成都，毕业于四川师范大学，内地流行男歌手，行星文化（音乐厂牌）创始人。2004年获“我型我秀”全国总冠军出道。2007年参加快乐男声，年底推出EP《最美的太阳》。2008年推出专辑《明天过后》，获中歌榜11项提名。2010年4月，受邀担任博鳌亚洲论坛表演嘉宾，10月获韩国Mnet亚洲音乐大奖“亚洲之星”奖。2012年5月于人民大会堂开启巡演。2013年2月，首次登上央视春晚，6月赴美国伯克利音乐学院进修。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "吴奇隆",
            "id": 60,
            "detail": "吴奇隆，1970年10月31日生于中国台湾，歌手、演员、制片人、出品人。1988年作为小虎队成员霹雳虎出道。1991年小虎队暂时解散。1992年单飞后发行首张个人专辑《追风少年》，销量在两个月内达到四白金。1992年起连续五年在《民生报》举办的投票中成为台湾十大最受欢迎偶像之一。1993年获得十大中文金曲最有前途新人奖金奖、十大劲歌金曲最受欢迎新人金奖。1993年起连续两年获得叱咤乐坛流行榜颁奖典礼过江龙奖金奖。1994年主演古装爱情电影《梁祝》。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "白百何",
            "id": 61,
            "detail": "白百何，1984年3月1日出生于山东省青岛市市北区，毕业于中央戏剧学院表演系本科班，中国内地影视女演员。2006年，因主演首部电视剧《与青春有关的日子》而进入演艺圈。2011年，凭借治愈系爱情电影《失恋33天》被观众熟知，并获得第31届大众电影百花奖最佳女主角奖，同时她还提名第49届台湾电影金马奖最佳女主角和第15届中国电影华表奖优秀女演员。2012年，因主演职场剧《浮沉》提名第19届上海电视节白玉兰奖最佳女演员。2013年，凭借爱情片《被偷走的那五年》入围第16届上海国际电影节最佳女演员。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "冯小刚",
            "id": 62,
            "detail": "冯小刚，1958年出生于北京，祖籍湖南省湘潭市，中国内地导演、编剧、演员。1984年担任剧情片《生死树》的美术助理，从而进入电影圈[1]  。1985年在北京电视艺术中心担任美工师[2]  。1991年担任中国首部电视系列喜剧《编辑部的故事》的编剧，并凭借该剧在中国内地获得关注[3]  。1994年执导个人首部电视剧《北京人在纽约》，该剧获得第12届中国电视金鹰奖最佳长篇连续剧奖[4]  。1997年执导中国内地首部贺岁电影《甲方乙方》，该片奠定了冯小刚黑色幽默的电影风格[5-6]  。1998年执导的喜剧爱情片《不见不散》成为中国内地电影年度票房冠军[7]  。2001年执导喜剧片《大腕》，该片获得第25届大众电影百花奖最佳影片奖[8]  。2003年执导的喜剧片《手机》在中国内地获得年度票房冠军"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "徐峥",
            "id": 63,
            "detail": "徐峥，1972年4月18日出生于上海，中国内地男演员、导演。1994年毕业于上海戏剧学院。1998年出演话剧《股票的颜色》获得第十届白玉兰戏剧奖最佳男主角奖。2000年凭借古装剧《春光灿烂猪八戒》中猪八戒一角走红；2002年，主演古装剧《李卫当官》。2007年主演贺岁喜剧电影《爱情呼叫转移》。2010年主演电影《人在囧途》。2012年，导演处女作《泰囧》以上映5天票房突破3亿刷新华语片首周票房纪录，以总票房12.69亿夺得亚洲电影大奖“亚洲最高票房”。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "王宝强",
            "id": 64,
            "detail": "王宝强，1984年5月29日出生于河北省邢台市，中国内地男演员、导演。王宝强6岁开始练习武术，8岁在嵩山少林寺做俗家弟子。2003年，凭借剧情片《盲井》获得第40届台湾电影金马奖最佳新演员奖[1-2]  。2004年，因参演冯小刚执导的剧情片《天下无贼》而获得关注。2008年，凭借《士兵突击》中许三多一角获得第24届中国电视金鹰奖最具人气男演员奖以及观众喜爱的电视剧男演员奖[3-4]  ；同年，因出演《我的兄弟叫顺溜》中顺溜一角而受到广泛关注[5]  。2010年，出演战争剧《为了新中国前进》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "刘嘉玲",
            "id": 65,
            "detail": "刘嘉玲（Carina Lau），1965年12月8日生于中国江苏苏州，1980年随父母移居香港，中国香港影视女演员、歌手。1984年毕业于香港无线电视台第12期艺员训练班；1989年主演TVB电视剧《上海大风暴》一人分饰两角；1991年凭借《阿飞正传》获得法国南特三大洲电影节最佳女主角；1998年参演电影《自梳》获得第3届香港电影金紫荆奖最佳女主角[1]  ；2007年主演《好奇害死猫》获得第16届中国金鸡百花电影节最佳女主角[2-3]  ；2008年7月刘嘉玲与梁朝伟在南亚佛国不丹完婚[4]  ；2011年凭借《狄仁杰之通天帝国》获得30届香港电影金像奖最佳女主角；2014年凭借《过界男女》饰演阔太一角荣获第9届大阪亚洲影展最佳女主角"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "罗志祥",
            "id": 66,
            "detail": "罗志祥（Show Lo），1979年7月30日出生于中国台湾省基隆市，华语流行男歌手。1994年出道，2003年罗志祥推出首张个人专辑《Show Time》。[2]  2005年举行首场个人演唱会，成为第一位踏上台北小巨蛋的流行歌手。[3]  2008年发行第六张专辑《潮男正传》，获MTV亚洲音乐大奖。[4]  2010年专辑《罗生门》获“五白金”。2012年前往日本乐坛发展，推出首张日文单曲《Dante》，《Dante》推出首周即登上日本公信榜单曲周榜第十名，使罗志祥成为首位于日本公信榜单曲获得前十名的台湾男歌手。[5]  13年第十张专辑《狮子吼》获认证四白金唱片，使罗志祥连续四年（2010—2013）成为台湾地区年度唱片销售总冠军。[6-8]  16年，开启个人第四次《CRAZY WORLD疯狂世界》世界巡回演唱会。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "林更新",
            "id": 67,
            "detail": "林更新，1988年2月13日出生于辽宁省沈阳市铁西区，中国内地新生代男演员，2011年毕业于上海戏剧学院表演系。2011年，因出演清穿剧《步步惊心》中的十四阿哥而走红，之后主演了《轩辕剑之天之痕》、《舞乐传奇》《武神赵子龙》等电视剧。2013年，参演徐克导演电影《狄仁杰之神都龙王》，以沙陀忠一角获得第33届香港电影金像奖最佳新人奖提名，该片获得6亿票房。2014年4月主演电影《同桌的你》获得4.6亿票房；10月主演电影《痞子英雄之黎明升起》超过2亿票房；"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "汪涵",
            "id": 68,
            "detail": "汪涵，1974年出生在江苏省苏州市吴中区，中国民主促进会（民进）会员，中国民主促进会中央委员[1]  ，湖南卫视节目主持人，国内综艺主持，曾主持过《音乐不断歌友会》 、《超级女声》、 《快乐男生》等节目，现主持《天天向上》、《越策越开心》等。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "蒋欣",
            "id": 69,
            "detail": "蒋欣，1983年5月8日出生于新疆维吾尔自治区乌鲁木齐市，中国内地女演员，毕业于河南艺术职业学院。从1991年开始参加影视剧拍摄，1991年其主演的电视剧《坠子皇后》播出；2001年出演古装历史剧《大脚马皇后》，2003年蒋欣因在张纪中版古装武侠剧《天龙八部》中饰演木婉清而走红。2004年出演偶像古装剧《仙剑奇侠传》和《欢天喜地七仙女》。2011年，因在古装宫斗剧《甄嬛传》中饰演华妃而获得广泛关注，并获得安徽卫视国剧盛典最佳女配角奖等多个奖项。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陈伟霆",
            "id": 70,
            "detail": "陈伟霆（William Chan），1985年11月21日出生于中国香港，华语影视男演员、歌手、主持人。2003年，因参加全球华人新秀香港区选拔赛而进入演艺圈。2006年成为Sun Boy’z组合一员。2008年开始独立发展，随后推出个人首张专辑《Will Power》，并获香港十大劲歌金曲颁奖礼最受欢迎男新人金奖及香港十大中文金曲最有前途新人金奖。2013年，陈伟霆将工作重心转移至中国内地，并凭借灾难电影《救火英雄》获得澳门国际电影节最佳男配角奖。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陆毅",
            "id": 71,
            "detail": "陆毅，1976年1月6日出生于上海，毕业于上海戏剧学院表演系，中国内地影视男演员、歌手。1999年，凭借海岩剧《永不瞑目》获得第18届中国电视金鹰奖最佳男主角，而他也因此正式进入演艺圈并受到关注。2001年，主演古装剧《少年包青天2》。2002年，因主演青春励志剧《壮志雄心》获得年度中央电视台电视剧十佳男演员；同年，他还凭借爱情片《一见钟情》提名第25届大众电影百花奖最佳男主角奖。2003年，其主演的都市剧《男才女貌》取得全国年度电视剧收视冠军；"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "梁朝伟",
            "id": 72,
            "detail": "梁朝伟，1962年6月27日出生于中国香港，祖籍广东省台山市，毕业于香港无线训练班第11期，国家一级演员。1982年考入无线电视艺员训练班，正式进入演艺界。20世纪80年代拍摄了多部电视剧。1984年因出演电视剧《鹿鼎记》中的韦小宝一角受到关注[1]  。1990年主演电影《喋血街头》[2]  。1994年凭借电影《重庆森林》获得第14届香港电影金像奖最佳男主角奖、第31届台湾电影金马奖最佳男主角奖[3]  。1997年凭借电影《春光乍泄》获得第17届香港电影金像奖最佳男主角奖[4]  。1998年主演电影《暗花》。2000年凭借电影《花样年华》获得第53届戛纳国际电影节最佳男主角奖以及第20届香港电影金像奖最佳男主角"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "韩寒",
            "id": 73,
            "detail": "韩寒，1982年9月23日出生于上海市金山区亭林镇，中国作家、导演、职业赛车手。1999年，他以《杯中窥人》一文获得首届全国新概念作文比赛一等奖[1]  。2000年，在上高一的韩寒退学，后出版首部长篇小说《三重门》[2]  。2001年，他出版文集《零下一度》，该书获得当年全国图书畅销排行榜第一名。2002年，他出版小说《像少年啦飞驰》。2003开始职业赛车生涯。2004年3月，他出版文集《韩寒五年》。2005年开通博客，开始博客写作[3]  。2006年9月，发行个人首张唱片书《寒·十八禁》[4]  。2009年，他主编《独唱团》。2010年，韩寒登上美国《时代周刊》封面[5]  。2011年，他出版杂文集《青春》。2012年6月，韩寒发布了APP阅读应用“ONE·一个”[6]  。2013年，他出版《一个：很高兴见到你》。2014年7月导演的《后会无期》在中国内地上映[7]  。2015年担任青春电影《沙漏》的监制"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张国立",
            "id": 74,
            "detail": "张国立，1955年1月17日生于天津，全国政协委员[1]  ，国家一级演员、导演、制片人、主持人。中国铁路文工团演员、重庆大学美视电影学院院长、硕士生导师，北京国立常升影视文化传播有限公司董事长、上影寰亚文化发展（上海）有限公司总经理"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张惠妹",
            "id": 75,
            "detail": "张惠妹（A Mei），1972年8月9日出生于中国台湾台东县卑南乡泰安部落，中国台湾流行乐女歌手。1996年，发行首张专辑《姐妹》，销售量超过108万张，打破96年台湾本地歌手的销售纪录[1]  。1997年，张惠妹推出第二张专辑《BAD BOY》，累计销售135万张，打破97年台湾女歌手销售纪录[2]  。1998年，获得美国Billboard亚洲最受欢迎女歌手奖[3]  。2001年，加盟华纳唱片。2002年登上美国《时代周刊》封面[4]  ，凭借专辑《真实》获得第13届金曲奖最佳女演唱人奖[5]  。2009年6月26日，推出专辑《阿密特》[6]  。2010年6月26日，获得第21届台湾金曲奖流行音乐颁奖礼最佳国语女歌手奖[7]  。2011年，发行专辑《你在看我吗》。2013年，张惠妹加盟第二季《中国好声音》[8]  ，首次担任导师，并带领其学员李琦获得年度总冠军[9]  。2014年6月30日，加盟EMI，并担任品牌总监职务[10]  。同年7月2日，发行专辑《偏执面》[11]  。2015年4月4日，发行专辑《阿密特2》。同年6月27日，获得第26届台湾金曲奖最佳国语女歌手"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "赵薇",
            "id": 76,
            "detail": "赵薇（Vicki，1976年3月12日-）生于安徽省芜湖市，中国大陆女演员、歌手、导演，北京电影学院导演系硕士，中国电影表演艺术学会副会长，中国电影导演协会执行委员。1998年起，因主演电视剧《还珠格格》系列而成名，先后打破并创造了有收视率记录以来的中国电视剧收视记录，荣膺金鹰奖最佳女主角。其后主演的《情深深雨濛濛》、《京华烟云》均成为当年年度收视冠军剧。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "刘诗诗",
            "id": 77,
            "detail": "刘诗诗，原名刘诗施，1987年3月10日出生于北京市，中国内地影视女演员、影视出品人。2002年，考入北京舞蹈学院芭蕾舞专业本科班学习。2004年，因在爱情剧《月影风荷》中饰演女主角叶风荷而踏入演艺圈。2010年，凭借仙侠剧《仙剑奇侠传三》受到更多关注。2011年，因在宫廷剧《步步惊心》中饰演马尔泰·若曦而赢得颇高人气，并获得第十八届上海电视节白玉兰奖最具人气女演员奖等奖项。2012年，凭借仙侠剧《轩辕剑之天之痕》获得国剧盛典年度最具人气女演员奖；"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "黄磊",
            "id": 78,
            "detail": "黄磊，1971年12月6日出生于江西省南昌市，中国大陆男演员、导演、编剧、监制、制片人、歌手、教师。1990年黄磊考入北京电影学院表演系，同年出演陈凯歌执导电影《边走边唱》。1996年凭借电影《夜半歌声》获得第3届中国长春电影节最佳男配角奖。1997年北京电影学院硕士毕业后留校任教，同年发行第一张音乐专辑《边走边唱》。1999年出演电视剧《人间四月天》，饰演徐志摩。2001年主演电视剧《橘子红了》。2003年自编自导自演第一部电视剧《似水年华》，并发行同名专辑。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "唐嫣",
            "id": 79,
            "detail": "唐嫣，1983年12月6日出生于上海市，毕业于中央戏剧学院表演系本科班，中国内地影视女演员。2001年，参加第三届舒蕾世纪星选美比赛获得冠军。2004年，因被导演张艺谋选中成为“奥运宝贝”之一，参加雅典奥运会闭幕式“中国8分钟”而被观众熟知。2009年，凭借古装仙侠剧《仙剑奇侠传三》获得关注。2011年1月22日，其主演的都市言情剧《夏家三千金》取得卫视年度收视冠军，而唐嫣亦凭借该剧获得国剧盛典年度网络最受欢迎内地女演员奖。2012年，成立唐嫣工作室。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "孙红雷",
            "id": 80,
            "detail": "孙红雷，1970年8月16日出生于黑龙江省哈尔滨市，中国内地男演员，毕业于中央戏剧学院表演系。1999年出演个人首部电影《我的父亲母亲》，从而进入电影圈[1]  。2000年凭借都市情感剧《像雾像雨又像风》获得关注。2003年凭借爱情片《周渔的火车》获得第10届北京大学生电影节最佳男主角奖[2]  。2008年在剧情片《梅兰芳》中饰演邱如白[3]  。2007年凭借家庭伦理剧《半路夫妻》获得第13届上海电视节白玉兰奖电视剧最佳男演员[4]  。2009年因在谍战剧《潜伏》中塑造了余则成一角，并凭借该剧先后获得第27届中国电视剧飞天奖优秀男演员奖"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "蔡依林",
            "id": 81,
            "detail": "蔡依林（Jolin Tsai），1980年9月15日出生于台湾省新北市，华语流行乐女歌手、服装设计师。[1] 1998年，蔡依林在MTV音乐台举办的“新生卡位战”音乐比赛中夺得冠军。1999年7月发行个人首支单曲EP《和世界做邻居》，并从此开启演唱生涯；同年9月发行首张专辑《Jolin 1019》正式出道。[2]  2002年，蔡依林发表了自己的转型复出之作《骑士精神》。2003年发行专辑《看我72变》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张艺兴",
            "id": 82,
            "detail": "张艺兴（LAY），1991年10月7日出生于湖南省长沙市，中国男歌手、演员，男子演唱组合EXO/EXO-M中国籍成员。2005年， 张艺兴参加湖南经视《明星学院》比赛并获得总决赛季军。2008年，通过S.M. Casting System在中国的选拔成为韩国SM公司旗下练习生。2012年4月，以EXO团体和其子队EXO-M成员身份正式出道。2015年4月8日，张艺兴在中国成立个人工作室，5月，加盟励志体验真人秀节目《极限挑战》，同年，他还获得亚洲影响力东方盛典最具影响力全能艺人。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "刘恺威",
            "id": 83,
            "detail": "刘恺威，1974年10月13日生于香港，中国影视男演员、歌手、电视剧制片人。1993年获加拿大华人歌手选拔赛冠军。1994年进入TVB，从而正式出道。1997年推出首张国语专辑《LALALA我爱你》。1999年出演商战剧《创世纪》。2005年在主演了时装剧《甜孙爷爷》后，刘恺威离开了TVB。2007年将演艺事业的重心转向中国内地。2008年因在年代剧《凤穿牡丹》中饰演霍冬青一角而获得福建电视台“我爱我剧”颁奖典礼最受观众喜爱的男演员奖。2010年主演爱情剧《国色天香》；"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "郭富城",
            "id": 84,
            "detail": "郭富城（Aaron Kwok），1965年10月26日出生于中国香港，歌手、演员、舞者，华语歌坛劲歌热舞代表人物之一。[1] 1984年考入香港TVB舞蹈训练班，1990年以光阳机车广告走红台湾，同年发行个人首张专辑《对你爱不完》开启了他的音乐舞台生涯，此后相继推出《我是不是该安静的走开》《狂野之城》《para para sakura》《动起来》等歌曲，奠定其舞台型歌手风格，曾三度获香港十大劲歌金曲最受欢迎男歌星奖，2005年成为首位获得“香港舞蹈年奖“的艺人。2008年舞林正传演唱会450°旋转舞台载入吉尼斯世界纪录。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "霍建华",
            "id": 85,
            "detail": "霍建华（Wallace Huo），1979年12月26日出生于台湾台北市，祖籍山东烟台龙口，华语影视男演员、歌手、出品人。2002年，因主演偶像剧《摘星》正式踏入演艺圈。2003年，凭借偶像爱情励志剧《海豚湾恋人》在台湾崭露头角。2004年，霍建华将事业重心转向内地，凭借古装武侠剧《天下第一》走入内地观众的视线。2006年，霍建华出演个人首部大银幕作品《做头》。2009年，凭借《仙剑奇侠传三》徐长卿一角在两岸三地赢得广泛关注。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "谢霆锋",
            "id": 86,
            "detail": "谢霆锋（Nicholas Tse），1980年8月29日出生香港，祖籍广东番禺，演员、歌手、音乐创作人、制作人、主持人、青年企业家、PO朝霆创始人。1987年随父母移居加拿大；1995年留学日本东京修读音乐，15岁创作第一首歌《估计错误》[1]  ；1996年正式出道[2]  。1997—1999年4月发行了《无声仿有声》《末世纪的呼声》等五张专辑。1999年发行其第一张国语专辑《谢谢你的爱1999》[3-4]  。2000年参加央视春节联欢晚会和举行“Viva Live”世界巡回演唱会[5-7]  。2001年以《玉蝴蝶》和《世纪预言》在世界音乐大奖中获“全球最高销量之亚洲最畅销男歌手”奖"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张嘉译",
            "id": 87,
            "detail": "张嘉译，1970年4月8日生于陕西西安，中国影视男演员。1991年毕业于北京电影学院。1990年出演人生第一部电影《魔表》。1995年，主演电视剧《道北人》出演张建国。2009年，凭借电视剧《蜗居》“宋思明”一角走红。2011年，参演《借枪》熊阔海一角获得第17届白玉兰最佳男演员奖。2013年，凭借在《浮沉》中的出色演出，再夺第19届白玉兰“最佳男演员”奖；同年，凭借《营盘镇警事》、《悬崖》、《心术》、《浮沉》获得第29届中国电视剧飞天奖颁奖典礼的“优秀男演员”奖。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "吴秀波",
            "id": 88,
            "detail": "吴秀波，1968年9月5日出生于北京市，中国内地男演员。毕业于中央戏剧学院表演系。2010年，凭借谍战剧《黎明之前》获得第26届中国电视金鹰奖最佳表演艺术男演员和受观众喜爱的电视剧男演员、华鼎奖最佳男主角、上海电视节最具人气男演员等奖项。2013年，凭借浪漫爱情喜剧片《北京遇上西雅图》获得第32届大众电影百花奖和第21届北京大学生电影节最佳男主角提名，此片票房突破5亿元，刷新华语爱情片票房记录。2014年，凭借古装剧《赵氏孤儿案》提名第42届国际艾美奖最佳男演员。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陈乔恩",
            "id": 89,
            "detail": "陈乔恩（Joe Chen），1979年4月4日出生于台湾省新竹县竹北市，华语影视女演员、主持人、歌手。2001年9月23日，陈乔恩正式出道，并于同年出演个人首部影视剧《薰衣草》。2002年，她凭借旅游节目《中国那么大》在台湾主持界崭露头角。2004年，陈乔恩随七朵花团体进军乐坛。2005年，其主演的爱情喜剧《王子变青蛙》打破台湾偶像剧收视纪录。2008年，主演的都市剧《命中注定我爱你》创下台湾电视史上偶像剧冠军收视纪录。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陈奕迅",
            "id": 90,
            "detail": "陈奕迅（Eason Chan），1974年7月27日出生于香港，中国香港男歌手、演员，毕业于英国金斯顿大学。1995年因获得第14届新秀歌唱大赛冠军而正式出道。1996年发行个人首张专辑《陈奕迅》。1997年主演个人首部电影《旺角大家姐》。1998年凭借歌曲《天下无双》在乐坛获得关注。2000年发行的歌曲《K歌之王》奠定其在歌坛的地位[1]  。2001年发行流行摇滚风格的专辑《反正是我》。2003年发行个人首张概念专辑《黑·白·灰》；专辑中的歌曲《十年》获得第4届百事音乐风云榜十大金曲奖[2]  。2005年发行的歌曲《浮夸》成为其歌唱生涯的代表作品之一。2006年起，连续9年获得叱咤乐坛流行榜颁奖典礼叱咤乐坛我最喜爱的男歌手奖[3]  。2008年1月，获得十大劲歌金曲最受欢迎男歌星奖”[4]  。2010年凭借剧情片《金钱帝国》获得星光大典港台年度电影男演员奖[5]  。2011年成立个人音乐制作公司EAS MUSIC[6]  。2012年发行舞曲风格的粤语专辑《…3mm》。2015年凭借专辑《米·闪》获得第26届台湾金曲奖最佳国语男歌手奖[7]  。2016年举行“Another Eason's LIFE世界巡回演唱会”"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "黄渤",
            "id": 91,
            "detail": "黄渤，1974年8月26日出生于山东青岛 ，中国内地男演员，毕业于北京电影学院表演系配音专业。黄渤早年曾有过驻唱歌手、舞蹈教练、影视配音等多种工作经历。2000年，黄渤出演管虎执导的电视电影《上车，走吧》，这是他的第一部影视作品。2006年凭借宁浩执导的电影《疯狂的石头》而成名。2009年，凭借《斗牛》获得第46届台湾电影金马奖“最佳男主角奖”。2010年，主演宁浩的喜剧电影《疯狂的赛车》。2012年，主演悬疑喜剧电影《杀生》，夺得第20届北京大学生电影节最佳男演员奖和第4届中国电影导演"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "郭德纲",
            "id": 92,
            "detail": "德纲，男，出生于1973年1月18日，天津人，相声表演艺术家，电影、电视剧演员，电视脱口秀主持人。1979年投身艺坛，先拜评书前辈高庆海学习评书，后跟随相声名家常宝丰学相声，又师从相声大师侯耀文。其间又学习了京剧、评剧、河北梆子等剧种，辗转梨园多年。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "古天乐",
            "id": 93,
            "detail": "古天乐，1970年10月21日出生于中国香港，中国香港男演员、歌手。1993年，古天乐签约TVB进入娱乐圈。1995年，在武侠剧《神雕侠侣》中首次担任男主角，饰演亦正亦邪的杨过而成名。1999年，凭借刑侦剧《刑事侦缉档案4》获得TVB万千星辉颁奖典礼最喜爱男主角奖[1]  。2000年，凭借在家族剧《创世纪》中的反派张自力夺得TVB万千星辉颁奖典礼我最喜爱电视角色奖；同年发行专辑《男朋友》。2001年，主演古装剧《寻秦记》，第2次获得TVB万千星辉颁奖典礼我最喜爱男主角奖"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "甄子丹",
            "id": 94,
            "detail": "甄子丹（Donnie Yen），1963年7月27日出生于中国广东，中国香港影视男演员、导演、武术指导。1992年相继出演电影《新龙门客栈》、《黄飞鸿之二：男儿当自强》，并凭《男儿当自强》获得当年香港金像奖最佳男配角提名。1995年在电视剧《精武门》中饰演陈真。1997年自导自演电影《战狼传说》。2002年担任《刀锋战士2》动作指导。2003年5月与年龄相差19岁的多伦多三料华埠小姐冠军汪诗诗结婚，现育有一子一女。2009年凭借影片《叶问》获得第16届北京大学生电影节最佳男演员。2010年，甄子丹参演《最强囍事》、《在一起》等都市爱情剧。2011年主演的《武侠》获得第48届台湾电影金马奖最佳动作设计。2014年2月，甄子丹主演的《西游记之大闹天宫》上映。2015年，凭借电影《一个人的武林》获得第38届香港电影金像奖最佳动作设计奖[1]  。2016年3月4日，主演的3D功夫电影《叶问3》国内上映"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "钟汉良",
            "id": 95,
            "detail": "钟汉良（Wallace Chung），1974年11月30日出生于中国香港，影视演员、歌手、舞者。1993年于香港无线电视台出道。1995年发行首张专辑《OREA》，连续两年被评为“台湾十大最受欢迎偶像”。2003年6月27日成立“花花草草音乐工作室”，2010年发行专辑《视觉动物》。2011、2012年两度获得“中国歌曲排行榜年度最佳舞台演绎男歌手奖”。2011年举办钟汉良S-Party演唱会。2015年发行专辑《乐作人生》 。"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "王菲",
            "id": 96,
            "detail": "王菲（Faye Wong），1969年8月8日出生于北京，中国流行乐女歌手、影视演员[1]  。1989年凭借歌曲《仍是旧句子》在香港歌坛出道[2]  ，同年发行首张个人专辑《王靖雯》[3]  。1992年推出专辑《COMING HOME》，碟内的《容易受伤的女人》，横扫全港，更在各电台电视台的音乐颁奖礼中，勇夺金曲，声势一时无两，令她一举跃入香港一线女歌手的行列。1993年在专辑《十万个为什么？》 中尝试另类音乐的风格[4]  。1994年发行专辑《天空》，并获得十大劲歌金曲最受欢迎女歌星奖；同年在香港红磡体育馆举办18场“最精彩演唱会”，打破中国香港歌手初次开演唱会的场次纪录[5]  。1996年成为首位登上美国《时代周刊》封面的华人歌手[6]。1998年因在央视春晚上演唱歌曲《相约1998》而在中国内地获得更多的关注[7]；同年发行专辑《唱游》，通过运用颤音、拖音等技巧确立其个人风格[8-9]  ，并于次年获得新加坡SPVA唱片畅销排行榜年度销量冠军"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "陈坤",
            "id": 97,
            "detail": "陈坤，中国内地男演员、歌手。1976年2月4日生于重庆，1995年考入东方歌舞团担任独唱歌手，1996年以专业第一名成绩考入北京电影学院表演系本科班。1999年主演电影《国歌》步入影坛；2000年，主演电视剧《像雾像雨又像风》。2003年，主演中央电视台年度收视冠军电视剧《金粉世家》。2007年主演电影《云水谣》，凭借陈秋水一角荣获中国电影华表奖优秀男演员奖；2010年凭借电影《画皮》获得第30届大众电影百花奖最佳男演员奖；2011年主演徐克执导的电影《龙门飞甲》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "邓超",
            "id": 98,
            "detail": "邓超，1979年出生于江西南昌，中国内地男演员、电影导演、投资出品人、互联网投资人。1995年考入江西艺术职业学院话剧班，1998年考入中央戏剧学院表演系，毕业后编入中国国家话剧院。2002年在《少年天子》中饰演顺治皇帝而成名，之后在《少年康熙》、《明末风云》、《天下第一》等剧中饰演皇帝而被称为“皇帝专业户”；2005年后主演《幸福像花儿一样》及《甜蜜蜜》，成功饰演“高干子弟”。2006年至2012年相继主演《少年包青天3》、《艰难爱情》、 《倚天屠龙记》、《你是我兄弟》及《相爱十年》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "张学友",
            "id": 99,
            "detail": "张学友，1961年7月10日出生于香港，中国香港男歌手、演员，毕业于香港崇文英文书院。1984年因获得首届香港十八区业余歌唱大赛冠军而出道。1985年发行个人首张专辑《Smile》。1993年发行的专辑《吻别》打破华语唱片在台湾的销量纪录[1]  。1995年起连续两年获得世界音乐大奖全球销量最高华人歌手奖[2-3]  。1997年参与策划的音乐剧《雪狼湖》在香港连续演出42场。1998年获得第9届台湾金曲奖最佳国语男演唱人奖[4]  。2001年获得第23届十大中文金曲金针奖[5]  。2004年发行首张个人全创作专辑《Life Is Like A Dream》。2010年12月30日至2011年12月29日，举办“张学友1/2世纪世界巡回演唱会”，打破12个月内巡演观众人数的吉尼斯世界纪录[6]  。2013年获得第35届十大中文金曲金曲35周年荣誉大奖[7]  。2016年举行“A CLASSIC TOUR 学友·经典世界巡回演唱会”"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "刘德华",
            "id": 100,
            "detail": "刘德华（Andy Lau），1961年9月27日出生于中国香港，演员、歌手、作词人、制片人。1981年出演电影处女作《彩云曲》[1]  。1983年主演的武侠剧《神雕侠侣》在香港获得62点的收视纪录[2-3]  。1985年因拒签五年合约而被TVB雪藏[4]  。1988年将事业重心转向电影[5]  。1991年创办天幕电影公司[6]  。1994年担任剧情片《天与地》的制片人[7]  。2000年凭借警匪片《暗战》获得第19届香港电影金像奖最佳男主角奖[8]  。2004年凭借警匪片《无间道3：终极无间》获得第41届台湾金马奖最佳男主角奖[9]  。2005年获得香港UA院线颁发的“1985-2005年全港最高累积票房香港男演员”奖[10]  。2006年获得釜山国际电影节亚洲最有贡献电影人奖[11]  。2011年主演剧情片《桃姐》，并凭借该片先后获得台湾金马奖最佳男主角奖、香港电影金像奖最佳男主角奖[12]  ；同年担任第49届台湾电影金马奖评审团主席[13]  。2017年主演警匪动作片《拆弹专家》"
        },
        {
            "main": 1,
            "pic": 1,
            "perChName": "胡歌",
            "id": 101,
            "detail": "胡歌，1982年9月20日出生于上海市徐汇区，中国内地演员、歌手、制片人。1996年，14岁的胡歌便成为上海教育电视台的小主持人，2005年毕业于上海戏剧学院表演系，同年在仙侠剧《仙剑奇侠传》中塑造了“李逍遥”一角，并演唱该剧插曲《六月的雨》《逍遥叹》。2006年8月遭受严重车祸，2007年6月复出。2009年主演仙侠剧《仙剑奇侠传三》。2010年主演的穿越剧《神话》在央视八套播出。2011年参演历史题材电影《辛亥革命》并提名大众电影百花奖“最佳新人奖”。"
        },
        {
            "main": 0,
            "pic": 0,
            "perChName": "xxx家人",
            "id": 102,
            "detail": "xxx家人"
        },
        {
            "main": 0,
            "pic": 0,
            "perChName": "xxx家人",
            "id": 103,
            "detail": "xxx家人"
        },
        {
            "main": 0,
            "pic": 0,
            "perChName": "xxx家人",
            "id": 104,
            "detail": "xxx家人"
        },
        {
            "main": 0,
            "pic": 0,
            "perChName": "xxx家人",
            "id": 105,
            "detail": "xxx家人"
        },
        {
            "main": 0,
            "pic": 0,
            "perChName": "xxx家人",
            "id": 106,
            "detail": "xxx家人"
        },
        {
            "main": 0,
            "pic": 0,
            "perChName": "xxx家人",
            "id": 107,
            "detail": "xxx家人"
        }
      ],
      urls:[
        {"url":'http://img3.imgtn.bdimg.com/it/u=1243579802,477407275&fm=26&gp=0.jpg'},
        {"url":'http://img0.imgtn.bdimg.com/it/u=165140877,3327178563&fm=26&gp=0.jpg'},
        {"url":'http://img0.imgtn.bdimg.com/it/u=165140877,3327178563&fm=26&gp=0.jpg'},
        {"url":'http://img3.imgtn.bdimg.com/it/u=3347118621,2155080646&fm=26&gp=0.jpg'},
        {"url":'http://img0.imgtn.bdimg.com/it/u=2847987682,2833770564&fm=26&gp=0.jpg'}
      ],
     // temp:false
    }
  },
  methods:{
    Search(){
      var temp = 1
      for(let i = 0;i<this.data.length;i++)
      { 
        if(this.name == this.data[i].perChName)
            {   temp = 0
                this.datail = this.data[i].detail
                this.name = this.data[i].perChName
                // this.img = this.urls[i].url
                document.getElementById("demo1").innerHTML= this.data[i].detail,
                document.getElementById("name").innerHTML= this.data[i].perChName
            }
            console.log(temp)  
       }
       if(temp == 1){
            this.$message({
                message: '没有这个明星',
                type: 'warning'
            });
       }else{
           this.$message({
            message: '查询成功',
            type: 'success'
        });
       }
       temp = 1
    },
          open() {
        this.$alert('更多信息请稍后', '更多信息', {
          confirmButtonText: '确定',
          callback: action => {
            this.$message({
              type: 'info',
              message: "退出成功"
            });
          }
        });
      },
    handleClose(done) {
        this.$confirm('确认关闭？')
          .then(_ => {
            done();
          })
          .catch(_ => {});
      }
  }
}
</script>
<style lang="scss" scoped>
#Main{
  width: 600px;
    .text {
    font-size: 14px;
  }

  .item {
    margin-bottom: 18px;
  }

  .clearfix:before,
  .clearfix:after {
    display: table;
    content: "";
  }
  .clearfix:after {
    clear: both
  }

  .box-card {
    width: 200px;

  }
}
</style>